import 'package:flutter/material.dart';
import './exhibit_details.dart';
import './exhibit_manager.dart';
import './models/Exhibit.dart';

void main() => runApp(MyApp());

class MyApp extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: 'Museum',
      theme: ThemeData(
        brightness: Brightness.light,
        primarySwatch: Colors.orange,
        accentColor: Colors.orangeAccent,
      ),
      home: ExhibitManager(
        [
          Exhibit.fromJson({
            "nfc_id": "0A:FA:86:A4",
            "id": "2000",
            "title": "Богд Хааны Алтан Гутал",
            "description":
                "Хааны эдэлж хэрэглэж байсан алтадсан савхин гадартай, ширэн ултай энэ гутал нь Монголчуудын дунд Богд хааны алтан гутал хэмээн нэрлэгддэг. \n Эл гутал нь 43,5 см өндөр, 35 см урт.",
            "image": "assets/exhibit/golden_boots.jpg",
          }),
          Exhibit.fromJson({
            "nfc_id": "A5:12:CA:95",
            "id": "2001",
            "title": "Богд Хааны Улаан Ордон",
            "description":
                "Олноо өргөгдсөний 2 дугаар оноос хүрээний зураачид Богд хааны зарлигаар Их хүрээний сав газар, түүний ойр орчим байгаа тэр үеийн нийгэм, амьдралын олон талын үйл явдлуудыг тусгаж харуулсан олон сайхацуврал зургуудыг том жижиг хэмжээгээр зурж байсан.",
            "image": "assets/exhibit/red_palace.jpeg",
          }),
          Exhibit.fromJson({
            "nfc_id": "5F:E5:48:ED:1A:FD:60",
            "id": "2002",
            "title": "Халх Хаалга",
            "description":
                "Халх хаалга /Ямпай/ -ыг хааны зарлигаар байгуулагдсан сүм болон ордны өмнө талд хамгаалалт хаалт болгон барьдаг. Энэ нь тухайн сүм, ордны эзний сүр хүчийг зэрэг дэвийн илэрхийлэл гэж ойлгож болно. Аливаа муу бүхнийг өөртөө шингээн авч байдаг гэж үздэг бөгөөд сүүдэрт нь дайруулан явахыг цээрлэнэ. Хаалгыг Хөх тоосгоор босгож, хос луу ороолдон, уул сүндэрлэж, ус урссан дүрс, хээ угалз зэргийг ингэмэл барималаар урласан. Энэ нь нүдэнд үл үзэгдэх хийгээд үзэгдэх ад зэтгэр, өвчин жижиг тэргүүтэн элдэв аюулаас эгнэгт халхлан хамгаалах бэлгэдэлтэй юм.",
            "image": "assets/exhibit/khalkh_gate.jpg",
          }),
          Exhibit.fromJson({
            "nfc_id": "04:14:63:EA:A9:48:80",
            "id": "2003",
            "title": "Асарт гурван үүд",
            "description":
                "\"Ёслол хүндэтгэлийн их үүд\", Энэ үүдээр сав, шимийн буянт сайн үйлс, амгалан жаргалан бүхэн чөлөөтэй орж ирэхийн бэлгэдэлтэй учир үргэлжид нээлттэй байдаг байна. Гол үүдээр нь Богд Хаан, Дондогдулам хатныхаа хамтаар морилдог байжээ. Зүүн үүдээр хан, ван тэргүүтэн хэргэмтэнүүд, хүрээ хамба, цорж лам тэргүүтэн мяндагтан хуваргууд, гадаадын зочид морилцгоодог бол баруун үүдээр хөгжмийн болон торгон цэргүүд ордог байсан гэдэг. Гол үүдний дээд талын есөн алтан луу хүрээлсэн хөх номин өнгийн дэвсгэр бүхий самбарт “Бадаргуулт төрийн гучин гуравдугаар оны гурван сард”, “VIII үеийн Богд Жавзандамба хутагтад”, “Зарлигаар шагнасан”, “Сайныг цэнгэлдэн хүртэхүйеэ дуртай” гэж сонгодог монгол, манж, төвд, хятад бичгээр дуурсгажээ.",
            "image": "assets/exhibit/three_gate.jpeg",
          }),
          Exhibit.fromJson({
            "nfc_id": "C1:19:34:63",
            "id": "2004",
            "title": "Амгалан энхийн үүд",
            "description":
                "Хаант төрийн ёслолын их үүд. 1911 онд VIII Богд Жавзандамбыг Олноо Өргөгдсөн Монгол Улсын шашин төрийг хослон барьсан хэмжээгүй эрхт хаанаар өргөмжилсөн түүхэн үйл явдалд зориулж “Амгалан энхийн үүд” –ийг 1912-1919 оны хооронд барьжээ. Энэ үүдний зураг төслийг уран барилгач, “Зоригт” цолт Баажав тэргүүлэн Санжид, Тэжаан нарын зэрэг хүмүүс зохиосон гэдэг. Энэ үүдийг барихад халх 4 аймаг, шавь 5 газраас нарийн мэргэжлийн мужаан, төмөрчин болон уран барилгачид, урчуудыг урин залж, 280 000 лан (103 гаруй кг) мөнгөний өргөл зардлаар 108 төрлийн оньс сүлжээ, угсрах арга ашиглан нэг ч хадаас оруулалгүй бүтээсэн юм. Үндсэн бүтцийн хувьд 8 тулгуур багана, 7 үет дээвэртэй, олон зүйл хээ угалз, амьтны дүрс, Тансан ламын намтар, 4 махранз, 8 тахил зэрэг өнгө будаг төгс зохицонгуй уран зургууд бүхий чимэгтэй бөлгөө.",
            "image": "assets/exhibit/peace_gate.jpeg",
          }),
        ],
      ),
    );
  }
}
